jacob-heathorn/mimxrt1170evk/firmware/cm7/rtos/netxduo/gigabit_ethernet_driver.h
#ifndef GIGABIT_ETHERNET_DRIVER_H
#define GIGABIT_ETHERNET_DRIVER_H

#include "ftl/singleton.hpp"
#include "fsl_enet.h"
#include "tx_buffer_descriptor_ring.h"
#include "ethernet_frame.hpp"
#include "nx_api.h"
#include "etl/queue.h"
#include <cstring>
#include <cassert>

// C++ driver class for Gigabit Ethernet
class GigabitEthernetDriver : public ftl::Singleton<GigabitEthernetDriver> {
public:
    // Constructor - public for ftl::Singleton
    GigabitEthernetDriver();
    ~GigabitEthernetDriver();

    // Initialize the driver (skeleton function for now)
    // Will eventually contain hardware initialization logic
    int initialize();

    // Send a frame (takes ownership of the frame)
    // Returns true on success, false on error
    bool send(ethernet::Frame&& frame);

    // Process transmitted packets - check for completed transmissions and release packets
    // This is called from the deferred processing routine
    void process_transmitted_packets();

    // Handle link mode change (speed/duplex change)
    // This is called when the PHY detects a link status change
    void handle_link_mode_change(unsigned int link_speed, unsigned int link_duplex);

private:
    // Constants - must match nx_driver_imxrt.h
    static constexpr unsigned int TX_DESCRIPTOR_COUNT = 64;  // NX_DRIVER_TX_DESCRIPTORS

    // Pointer to TX descriptor ring (allocated from OCRAM2)
    // Ring manages its own head/tail indices for queue-like behavior
    TxBufferDescriptorRing* tx_descriptor_ring_;

    // Queue of TxFrame objects pending transmission
    // TxFrames own their data and can release the original NX_PACKET immediately
    // Using ETL queue with fixed size matching TX_DESCRIPTOR_COUNT
    etl::queue<ethernet::TxFrame, TX_DESCRIPTOR_COUNT> tx_frame_queue_;
};

// C interface for calling from nx_driver_imxrt.c
#ifdef __cplusplus
extern "C" {
#endif

#include <stdbool.h>  // For bool type in C

// C wrapper function for initialize
int gigabit_ethernet_driver_initialize();

// C wrapper function for send (returns true on success, false on error)
// Note: packet must not be chained (nx_packet_next must be NULL)
bool gigabit_ethernet_driver_send(void* packet_ptr);

// C wrapper function for processing transmitted packets
void gigabit_ethernet_driver_process_transmitted_packets();


#ifdef __cplusplus
}
#endif

#endif // GIGABIT_ETHERNET_DRIVER_H